Revit 2026 API
GeometryCreationUtilities.CreateSweptGeometry Method
Overload List
Name | Description
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>)
CreateSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, SolidOptions)
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace